glm-disagg/results/qps/agg_tp4/result_qps6.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-agg
  Decode pod:   ms-glm-agg-llm-d-modelservice-decode-65894c7847-z2ctd
  Decode log:   results/qps/agg_tp4//decode_qps6.log
  Metrics from: agg pod  IP: 10.244.2.78 (port: 8000)

Starting decode pod log capture to results/qps/agg_tp4//decode_qps6.log ...

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  10.244.2.78: queue(sum=4494.790458, count=752) prefill(sum=1254.541710, count=752)

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
  Target: glm-agg | QPS: 6
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-agg 4096 256 6

#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-agg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 6 req/s (Poisson)  NUM_PROMPTS: 180

BENCH_RUN: request_rate=6 num_prompts=180
INFO 02-27 15:12:42 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 15:12:42 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 15:12:42 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 15:12:44 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f476c526d40>, seed=12151239, num_prompts=180, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=6.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-03bd3c78-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 15:12:46 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/180 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 6.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 180/180 [01:30<00:00,  1.99it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     180       
Failed requests:                         0         
Request rate configured (RPS):           6.00      
Benchmark duration (s):                  90.24     
Total input tokens:                      737100    
Total generated tokens:                  46080     
Request throughput (req/s):              1.99      
Output token throughput (tok/s):         510.63    
Peak output token throughput (tok/s):    2880.00   
Peak concurrent requests:                180.00    
Total token throughput (tok/s):          8678.80   
---------------Time to First Token----------------
Mean TTFT (ms):                          23321.70  
Median TTFT (ms):                        22589.83  
P99 TTFT (ms):                           45679.92  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          196.89    
Median TPOT (ms):                        198.72    
P99 TPOT (ms):                           332.24    
---------------Inter-token Latency----------------
Mean ITL (ms):                           196.89    
Median ITL (ms):                         63.57     
P99 ITL (ms):                            843.33    
==================================================
BENCH_RUN_END: request_rate=6

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  10.244.2.78: queue(sum=8243.942170, count=932) prefill(sum=1625.347697, count=932)

==============================================
Prometheus Metrics Summary (qps=6)
==============================================
  Pod 10.244.2.78:
    request_queue_time:   avg = 20.828621 s  (count=180)
    request_prefill_time: avg = 2.060033 s  (count=180)
  System total (1 pods):
    request_queue_time:   avg = 20.828621 s  (count=180)
    request_prefill_time: avg = 2.060033 s  (count=180)

Stopping log captures...
Decode log:  results/qps/agg_tp4//decode_qps6.log (10 lines, 4.0K)