glm-disagg/results/qps/agg_tp4/result_qps8.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-agg
  Decode pod:   ms-glm-agg-llm-d-modelservice-decode-65894c7847-z2ctd
  Decode log:   results/qps/agg_tp4//decode_qps8.log
  Metrics from: agg pod  IP: 10.244.2.78 (port: 8000)

Starting decode pod log capture to results/qps/agg_tp4//decode_qps8.log ...

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  10.244.2.78: queue(sum=14134.021429, count=1142) prefill(sum=2059.377435, count=1142)

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
  Target: glm-agg | QPS: 8
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-agg 4096 256 8

#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-agg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 8 req/s (Poisson)  NUM_PROMPTS: 240

BENCH_RUN: request_rate=8 num_prompts=240
INFO 02-27 15:16:27 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 15:16:27 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 15:16:27 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 15:16:29 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f81060a6d40>, seed=16151624, num_prompts=240, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=8.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-5fd13094-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 15:16:31 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/240 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 240/240 [01:57<00:00,  2.05it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     240       
Failed requests:                         0         
Request rate configured (RPS):           8.00      
Benchmark duration (s):                  117.24    
Total input tokens:                      982800    
Total generated tokens:                  61440     
Request throughput (req/s):              2.05      
Output token throughput (tok/s):         524.05    
Peak output token throughput (tok/s):    3600.00   
Peak concurrent requests:                240.00    
Total token throughput (tok/s):          8906.78   
---------------Time to First Token----------------
Mean TTFT (ms):                          36304.17  
Median TTFT (ms):                        35643.29  
P99 TTFT (ms):                           71770.57  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          249.73    
Median TPOT (ms):                        252.63    
P99 TPOT (ms):                           430.55    
---------------Inter-token Latency----------------
Mean ITL (ms):                           249.73    
Median ITL (ms):                         69.75     
P99 ITL (ms):                            855.07    
==================================================
BENCH_RUN_END: request_rate=8

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  10.244.2.78: queue(sum=22241.000535, count=1382) prefill(sum=2557.847094, count=1382)

==============================================
Prometheus Metrics Summary (qps=8)
==============================================
  Pod 10.244.2.78:
    request_queue_time:   avg = 33.779080 s  (count=240)
    request_prefill_time: avg = 2.076957 s  (count=240)
  System total (1 pods):
    request_queue_time:   avg = 33.779080 s  (count=240)
    request_prefill_time: avg = 2.076957 s  (count=240)

Stopping log captures...
Decode log:  results/qps/agg_tp4//decode_qps8.log (13 lines, 4.0K)